const serUnit = require("../serUnit");

describe("serialize function", () => {
  test("serialize not array", () => {
      const input = '';
      const output = '';
      expect(serUnit.serial(input)).toBe(output);
  });
  test("serialize array not integer", () => {
      const input = ['a'];
      const output = '';
      expect(serUnit.serial(input)).toBe(output);
  });
  test("serialize array 0-9", () => {
      const input = [0,1,2,3,4,5,6,7,8,9];
      const output = '0!1!2!3!4!5!6!7!8!9';
      expect(serUnit.serial(input)).toBe(output);
  });
  test("serialize array 10-99", () => {
      let input = [];
      for (let i=10; i<100; i++)
        input.push(i);
      const output = 'q!w!e!r!t!y!u!i!o!p!a!s!d!f!g!h!j!k!l!z!x!c!v!b!n!m!Q!W!E!R!T!Y!U!I!O!P!A!S!D!F!G!H!J!K!L!Z!X!C!V!B!N!M!й!ц!у!к!е!н!г!ш!щ!з!х!ъ!ф!ы!в!а!п!р!о!л!д!ж!э!я!ч!с!м!и!т!ь!б!ю!Й!Ц!У!К!Е!Н';
      expect(serUnit.serial(input)).toBe(output);
  });
  test("serialize array 100-999", () => {
      let input = [];
      for (let i=100; i<1000; i++)
        input.push(i);
      const output = 'q0!q1!q2!q3!q4!q5!q6!q7!q8!q9!w0!w1!w2!w3!w4!w5!w6!w7!w8!w9!e0!e1!e2!e3!e4!e5!e6!e7!e8!e9!r0!r1!r2!r3!r4!r5!r6!r7!r8!r9!t0!t1!t2!t3!t4!t5!t6!t7!t8!t9!y0!y1!y2!y3!y4!y5!y6!y7!y8!y9!u0!u1!u2!u3!u4!u5!u6!u7!u8!u9!i0!i1!i2!i3!i4!i5!i6!i7!i8!i9!o0!o1!o2!o3!o4!o5!o6!o7!o8!o9!p0!p1!p2!p3!p4!p5!p6!p7!p8!p9!a0!a1!a2!a3!a4!a5!a6!a7!a8!a9!s0!s1!s2!s3!s4!s5!s6!s7!s8!s9!d0!d1!d2!d3!d4!d5!d6!d7!d8!d9!f0!f1!f2!f3!f4!f5!f6!f7!f8!f9!g0!g1!g2!g3!g4!g5!g6!g7!g8!g9!h0!h1!h2!h3!h4!h5!h6!h7!h8!h9!j0!j1!j2!j3!j4!j5!j6!j7!j8!j9!k0!k1!k2!k3!k4!k5!k6!k7!k8!k9!l0!l1!l2!l3!l4!l5!l6!l7!l8!l9!z0!z1!z2!z3!z4!z5!z6!z7!z8!z9!x0!x1!x2!x3!x4!x5!x6!x7!x8!x9!c0!c1!c2!c3!c4!c5!c6!c7!c8!c9!v0!v1!v2!v3!v4!v5!v6!v7!v8!v9!b0!b1!b2!b3!b4!b5!b6!b7!b8!b9!n0!n1!n2!n3!n4!n5!n6!n7!n8!n9!m0!m1!m2!m3!m4!m5!m6!m7!m8!m9!Q0!Q1!Q2!Q3!Q4!Q5!Q6!Q7!Q8!Q9!W0!W1!W2!W3!W4!W5!W6!W7!W8!W9!E0!E1!E2!E3!E4!E5!E6!E7!E8!E9!R0!R1!R2!R3!R4!R5!R6!R7!R8!R9!T0!T1!T2!T3!T4!T5!T6!T7!T8!T9!Y0!Y1!Y2!Y3!Y4!Y5!Y6!Y7!Y8!Y9!U0!U1!U2!U3!U4!U5!U6!U7!U8!U9!I0!I1!I2!I3!I4!I5!I6!I7!I8!I9!O0!O1!O2!O3!O4!O5!O6!O7!O8!O9!P0!P1!P2!P3!P4!P5!P6!P7!P8!P9!A0!A1!A2!A3!A4!A5!A6!A7!A8!A9!S0!S1!S2!S3!S4!S5!S6!S7!S8!S9!D0!D1!D2!D3!D4!D5!D6!D7!D8!D9!F0!F1!F2!F3!F4!F5!F6!F7!F8!F9!G0!G1!G2!G3!G4!G5!G6!G7!G8!G9!H0!H1!H2!H3!H4!H5!H6!H7!H8!H9!J0!J1!J2!J3!J4!J5!J6!J7!J8!J9!K0!K1!K2!K3!K4!K5!K6!K7!K8!K9!L0!L1!L2!L3!L4!L5!L6!L7!L8!L9!Z0!Z1!Z2!Z3!Z4!Z5!Z6!Z7!Z8!Z9!X0!X1!X2!X3!X4!X5!X6!X7!X8!X9!C0!C1!C2!C3!C4!C5!C6!C7!C8!C9!V0!V1!V2!V3!V4!V5!V6!V7!V8!V9!B0!B1!B2!B3!B4!B5!B6!B7!B8!B9!N0!N1!N2!N3!N4!N5!N6!N7!N8!N9!M0!M1!M2!M3!M4!M5!M6!M7!M8!M9!й0!й1!й2!й3!й4!й5!й6!й7!й8!й9!ц0!ц1!ц2!ц3!ц4!ц5!ц6!ц7!ц8!ц9!у0!у1!у2!у3!у4!у5!у6!у7!у8!у9!к0!к1!к2!к3!к4!к5!к6!к7!к8!к9!е0!е1!е2!е3!е4!е5!е6!е7!е8!е9!н0!н1!н2!н3!н4!н5!н6!н7!н8!н9!г0!г1!г2!г3!г4!г5!г6!г7!г8!г9!ш0!ш1!ш2!ш3!ш4!ш5!ш6!ш7!ш8!ш9!щ0!щ1!щ2!щ3!щ4!щ5!щ6!щ7!щ8!щ9!з0!з1!з2!з3!з4!з5!з6!з7!з8!з9!х0!х1!х2!х3!х4!х5!х6!х7!х8!х9!ъ0!ъ1!ъ2!ъ3!ъ4!ъ5!ъ6!ъ7!ъ8!ъ9!ф0!ф1!ф2!ф3!ф4!ф5!ф6!ф7!ф8!ф9!ы0!ы1!ы2!ы3!ы4!ы5!ы6!ы7!ы8!ы9!в0!в1!в2!в3!в4!в5!в6!в7!в8!в9!а0!а1!а2!а3!а4!а5!а6!а7!а8!а9!п0!п1!п2!п3!п4!п5!п6!п7!п8!п9!р0!р1!р2!р3!р4!р5!р6!р7!р8!р9!о0!о1!о2!о3!о4!о5!о6!о7!о8!о9!л0!л1!л2!л3!л4!л5!л6!л7!л8!л9!д0!д1!д2!д3!д4!д5!д6!д7!д8!д9!ж0!ж1!ж2!ж3!ж4!ж5!ж6!ж7!ж8!ж9!э0!э1!э2!э3!э4!э5!э6!э7!э8!э9!я0!я1!я2!я3!я4!я5!я6!я7!я8!я9!ч0!ч1!ч2!ч3!ч4!ч5!ч6!ч7!ч8!ч9!с0!с1!с2!с3!с4!с5!с6!с7!с8!с9!м0!м1!м2!м3!м4!м5!м6!м7!м8!м9!и0!и1!и2!и3!и4!и5!и6!и7!и8!и9!т0!т1!т2!т3!т4!т5!т6!т7!т8!т9!ь0!ь1!ь2!ь3!ь4!ь5!ь6!ь7!ь8!ь9!б0!б1!б2!б3!б4!б5!б6!б7!б8!б9!ю0!ю1!ю2!ю3!ю4!ю5!ю6!ю7!ю8!ю9!Й0!Й1!Й2!Й3!Й4!Й5!Й6!Й7!Й8!Й9!Ц0!Ц1!Ц2!Ц3!Ц4!Ц5!Ц6!Ц7!Ц8!Ц9!У0!У1!У2!У3!У4!У5!У6!У7!У8!У9!К0!К1!К2!К3!К4!К5!К6!К7!К8!К9!Е0!Е1!Е2!Е3!Е4!Е5!Е6!Е7!Е8!Е9!Н0!Н1!Н2!Н3!Н4!Н5!Н6!Н7!Н8!Н9';
      expect(serUnit.serial(input)).toBe(output);
  });
  test("serialize array 0-300", () => {
      let input = [];
      for (let i=0; i<=300; i++) {
        input.push(i);
        input.push(i);
        input.push(i);
        }
      const output = '0!1!2!3!4!5!6!7!8!9!3q!3w!3e!3r!3t!3y!3u!3i!3o!3p!3a!3s!3d!3f!3g!3h!3j!3k!3l!3z!3x!3c!3v!3b!3n!3m!3Q!3W!3E!3R!3T!3Y!3U!3I!3O!3P!3A!3S!3D!3F!3G!3H!3J!3K!3L!3Z!3X!3C!3V!3B!3N!3M!3й!3ц!3у!3к!3е!3н!3г!3ш!3щ!3з!3х!3ъ!3ф!3ы!3в!3а!3п!3р!3о!3л!3д!3ж!3э!3я!3ч!3с!3м!3и!3т!3ь!3б!3ю!3Й!3Ц!3У!3К!3Е!3Н!3q0!3q1!3q2!3q3!3q4!3q5!3q6!3q7!3q8!3q9!3w0!3w1!3w2!3w3!3w4!3w5!3w6!3w7!3w8!3w9!3e0!3e1!3e2!3e3!3e4!3e5!3e6!3e7!3e8!3e9!3r0!3r1!3r2!3r3!3r4!3r5!3r6!3r7!3r8!3r9!3t0!3t1!3t2!3t3!3t4!3t5!3t6!3t7!3t8!3t9!3y0!3y1!3y2!3y3!3y4!3y5!3y6!3y7!3y8!3y9!3u0!3u1!3u2!3u3!3u4!3u5!3u6!3u7!3u8!3u9!3i0!3i1!3i2!3i3!3i4!3i5!3i6!3i7!3i8!3i9!3o0!3o1!3o2!3o3!3o4!3o5!3o6!3o7!3o8!3o9!3p0!3p1!3p2!3p3!3p4!3p5!3p6!3p7!3p8!3p9!3a0!3a1!3a2!3a3!3a4!3a5!3a6!3a7!3a8!3a9!3s0!3s1!3s2!3s3!3s4!3s5!3s6!3s7!3s8!3s9!3d0!3d1!3d2!3d3!3d4!3d5!3d6!3d7!3d8!3d9!3f0!3f1!3f2!3f3!3f4!3f5!3f6!3f7!3f8!3f9!3g0!3g1!3g2!3g3!3g4!3g5!3g6!3g7!3g8!3g9!3h0!3h1!3h2!3h3!3h4!3h5!3h6!3h7!3h8!3h9!3j0!3j1!3j2!3j3!3j4!3j5!3j6!3j7!3j8!3j9!3k0!3k1!3k2!3k3!3k4!3k5!3k6!3k7!3k8!3k9!3l0!3l1!3l2!3l3!3l4!3l5!3l6!3l7!3l8!3l9!3z0!3z1!3z2!3z3!3z4!3z5!3z6!3z7!3z8!3z9!3x0';
      expect(serUnit.serial(input)).toBe(output);
  });
});
